Tekla Open API Reference for Tekla Structures 2025
AnalysisPartAnalysisProperties.PhysicalFreezed Property
 Indicates whether the physical part has been freezed.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool PhysicalFreezed { get; }
Public ReadOnly Property PhysicalFreezed As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
AnalysisPartAnalysisProperties Class
Tekla.Structures.Analysis Namespace